<a href="https://colab.research.google.com/github/mehrishka177/heh---heh-s-folder/blob/main/Untitled8.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
SELECT *
FROM employees AS e;  -- 'employees' table is aliased as 'e'

SELECT e.name, d.department_name
FROM employees AS e
JOIN departments AS d ON e.department_id = d.department_id;

SELECT first_name AS fname, last_name AS lname
FROM employees;

SELECT salary * 1.1 AS new_salary
FROM employees;

SELECT salary, salary * 1.1 AS new_salary
FROM employees;

SELECT e.name, e.salary
FROM (SELECT name, salary FROM employees) AS e;

SELECT department_id, COUNT(*) AS total_employees
FROM employees
GROUP BY department_id;

SELECT e.first_name AS employee_name, d.department_name
FROM employees AS e
JOIN departments AS d ON e.department_id = d.department_id
WHERE e.salary > 50000;

In [ ]:
| e.id | e.name     | e.salary | e.department_id |
|------|------------|----------|-----------------|
| 1    | John Doe   | 50000    | 1               |
| 2    | Jane Smith | 55000    | 2               |

In [ ]:
| fname | lname  |
|-------|--------|
| John  | Doe    |
| Jane  | Smith  |

In [ ]:
| new_salary |
|------------|
| 55000      |
| 60500      |

In [ ]:
| employee_name | department_name |
|---------------|-----------------|
| Jane          | Marketing       |
| Alice         | IT              |

In [ ]:
| employee_name | department_name |
|---------------|-----------------|
| Jane          | Marketing       |
| Alice         | IT              |